# =========================================
# Brew formulae
# =========================================

# Developer tools
brew "adr-tools"
brew "cmake"
brew "cmake-docs"
brew "cocoapods"
brew "gdb"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "go-size-analyzer"
brew "golangci-lint"
brew "gops"
brew "goreleaser"
brew "graphviz"
brew "gts"
brew "hf"
brew "hl"
brew "hugo"
brew "just"
brew "kdoctor"
brew "makensis"
brew "maven"
brew "mise"
brew "neovim"
brew "ninja"
brew "nvm"
brew "openapi-generator"
brew "pandoc"
brew "pipdeptree"
brew "pipx"
brew "pnpm"
# brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "sapling"
brew "scc"
brew "sccache"
brew "sqlc"
brew "tree-sitter"
brew "tree-sitter@0.25"
brew "trunk"
brew "typst"
brew "upx"
brew "usage"
brew "uv"
brew "yarn"
brew "zellij"
brew "zola"

# Languages, runtimes, and SDKs
brew "cargo-binstall"
brew "cargo-hack"
brew "cargo-udeps"
brew "certifi"
brew "cffi"
brew "dotnet"
brew "dotnet@8"
brew "dotnet@10"
brew "go"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luv"
brew "numpy"
brew "openjdk"
brew "openjdk@17"
brew "openjdk@21"
brew "openjdk@25"
brew "protobuf"
brew "pycparser"
# brew "pydantic"
# brew "pydantic-core"
brew "python-certifi"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "rpds-py"
brew "ruby"
brew "rustup"
brew "wasmer"
brew "zig"

# Cloud, containers, and infrastructure
brew "aws-vault"
brew "awscli"
brew "checkov"
# Verify whether this should be a brew formula or cask:
brew "container"
brew "dagger"
brew "detect-secrets"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "flyctl"
brew "hcledit"
brew "infracost"
brew "kubernetes-cli"
brew "spin"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "trivy"

# Databases, queues, and data tools
brew "etcd"
brew "golang-migrate"
brew "kafka"
brew "librdkafka"
brew "pgvector"
brew "postgresql@15"
brew "postgresql@16"
brew "postgresql@17"
brew "postgresql@18"
brew "redis"
brew "sqlite"

# CLI utilities and shell tools
brew "bat"
brew "cpufetch"
brew "eza"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "hyperfine"
brew "jq"
brew "k6"
brew "mas"
brew "mole"
brew "nushell"
brew "oha"
brew "p7zip"
brew "powerlevel10k"
brew "rclone"
brew "starship"
brew "tree"
brew "unzip"
brew "wget"
brew "wrk"
brew "zsh-completions"

# Networking and security
brew "ca-certificates"
brew "curl"
brew "gnutls"
brew "krb5"
brew "libssh2"
brew "nmap"
brew "openssl@3"
brew "openvpn"
brew "p11-kit"
brew "pkcs11-helper"
brew "unbound"

# Media, graphics, and UI
brew "fluid-synth"
brew "fontconfig"
brew "freetype"
brew "gd"
brew "gdk-pixbuf"
brew "giflib"
brew "gnuplot"
brew "harfbuzz"
brew "imagemagick"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "libavif"
brew "libheif"
brew "librsvg"
brew "libsndfile"
brew "libtiff"
brew "libvmaf"
brew "libxmp"
brew "little-cms2"
brew "mpg123"
brew "netpbm"
brew "openexr"
brew "openjph"
brew "opus"
brew "pango"
brew "pixman"
brew "portaudio"
brew "qt5compat"
brew "qtbase"
brew "qtdeclarative"
brew "qtshadertools"
brew "qtsvg"
brew "shared-mime-info"
brew "wavpack"
brew "webp"
brew "x265"

# Core libraries and dependencies
brew "abseil"
brew "aom"
brew "autoconf"
brew "automake"
brew "brotli"
brew "bzip2"
brew "c-ares"
brew "double-conversion"
brew "fmt"
brew "fribidi"
brew "gcc"
brew "gettext"
brew "glib"
brew "gmp"
brew "hdrhistogram_c"
brew "highway"
brew "hwloc"
brew "icu4c@78"
brew "imath"
brew "isl"
brew "libb2"
brew "libcerf"
brew "libdatrie"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgit2"
brew "libidn2"
brew "liblinear"
brew "libmpc"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libtasn1"
brew "libtensorflow"
brew "libthai"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvorbis"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "lld@20"
brew "llhttp"
brew "llvm"
brew "lz4"
brew "lzlib"
brew "lzo"
brew "m4"
brew "make"
brew "md4c"
brew "mold"
brew "mpdecimal"
brew "mpfr"
brew "ncurses"
brew "nettle"
brew "oniguruma"
brew "openblas"
brew "pcre2"
brew "pkgconf"
brew "readline"
brew "simdjson"
brew "tbb"
brew "unibilium"
brew "utf8proc"
brew "uvwasi"
brew "xorgproto"
brew "xz"
brew "z3"
brew "zstd"

# =========================================
# Casks
# =========================================

# Security
cask "1password-cli"
cask "keystore-explorer"

# AI tools
cask "codex"
cask "claude"
cask "claude-code"

# Browsers
cask "brave-browser"
cask "google-chrome"

# Developer apps
cask "ghostty"
cask "postman"
cask "visual-studio-code"
cask "zed"

# Business and communication
cask "microsoft-teams"
cask "notion"
# cask "zoom"

# Media
cask "iina"

# Fonts
cask "font-hack-nerd-font"

# Utilities
cask "rar"
